Tekla.Structures.Dialog.UIControls.WpfProfileCatalog
The WpfProfileCatalog class represents a group of controls to select profiles
using the profile catalog.
WpfProfileCatalog

Tekla.Structures.Dialog.UIControls.WpfProfileCatalog.#ctor
Initiates a new instance of the control.

Tekla.Structures.Dialog.UIControls.WpfProfileCatalog.#ctor(System.String)
Initiates a new instance of the control selecting the given profile.
Profile: The profile string that will
be selecteed in the dialog.

Tekla.Structures.Dialog.UIControls.WpfProfileCatalog.SelectedProfile
The selected profile in the control.

Tekla.Structures.Dialog.UIControls.WpfProfileCatalog.ButtonWidth
Gets and sets the width of the button control.

Tekla.Structures.Dialog.UIControls.WpfProfileCatalog.ButtonHeight
Gets and sets the height of the button control.

Tekla.Structures.Dialog.UIControls.WpfProfileCatalog.ButtonText
Gets and sets the text of the button control.

Tekla.Structures.Dialog.UIControls.WpfProfileCatalog.button_Loaded(System.Object,System.Windows.RoutedEventArgs)
When the load event is raised.
sender: The event sender.
e: The event arguments.

Tekla.Structures.Dialog.UIControls.WpfProfileCatalog.SelectClicked
The SelectClicked event is raised when the Select button is clicked.

Tekla.Structures.Dialog.UIControls.WpfProfileCatalog.SelectionDone
The SelectionDone event is raised when the selection has been done.
Remarks:
Please note that when filling in controls programmatically, use registered attribute.

Tekla.Structures.Dialog.UIControls.WpfProfileCatalog.InitializeComponent
InitializeComponent